# Analytical Element Connector Manager Property

Source: https://www.revitapidocs.com/2026/35ef5e7a-6341-d2ca-1a67-d855bf4a0ff9.htm

---

| Analytical Element Connector Manager Property |
| --- |

Retrieves the Connector Manager from this AnalyticalElement.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ConnectorManager ConnectorManager { get; }
```

```
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
```

```
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
```

```
member ConnectorManager : ConnectorManager with get
```

#### Property Value

ConnectorManager See Also

#### Reference

AnalyticalElement Class Autodesk.Revit.DB.Structure Namespace